# Задание: Выведите каждый элемент в списке из первого задания вместе с индексами.

movies = ["Ходячие мертвецы", "Красавцы", "Клан Сопрано", "Дневники вампира"]

for i, movie in enumerate(movies):
    print(f"Index: {i}, movie: {movie}")
