# Задание: Выведите каждый элемент в следующем списке: ["Ходячие мертвецы", "Красавцы", "Клан Сопрано",
# "Дневники вампира"].

movies = ["Ходячие мертвецы", "Красавцы", "Клан Сопрано", "Дневники вампира"]

for movie in movies:
    print(movie)
