# Задание: Напишите программу, которая будет выводить одно сообщение, если значение переменной меньше 10,
# и другое, если переменная больше или равна 10.

number = int(input('Enter the number: '))

if number < 10 :
    print('Your number is smaller than 10.')
else:
    print('Your number equal 10 or bigger.')
