# Задание: Выведите три различные строки.

print("""Line 1
...it's still line 1""")
print("Line 2")
print('Line 3')
