# Задание: Извлеките срез строки "И незачем так орать! Я и в первый раз прекрасно слышал." так, чтобы она содержала
# только символы до восклицательного знака.

line1 = "И незачем так орать! Я и в первый раз прекрасно слышал."

print(line1[:line1.index("!")])
