# Задание: Выведите каждый символ в строке "Чехов".

writer = "Чехов"

for i in range(0, len(writer)):
    print(writer[i])
