# Задание: Вызовите метод, который превращает строку "Где это? Кто это? Когда это?" в список.

line = "Где это? Кто это? Когда это?"
lines_list = line.split(' ')

print(lines_list)
