# Задание: Замените каждое вхождение буквы "о" в строке "Ребёнок - зеркало поступков родителей." цифрой 0.

line1 = "Ребёнок - зеркало поступков родителей."

print(line1.replace("о", "0"))
