# Задание: Создайте строку "тритритритри", используя конкатенацию, а затем сделайте то же самое, только с помощью
# умножения (серьёзно?)

print("три" + "три" + "три" + "три")

print("три" * 4)