# Задание: Вызовите какую-нибудь функцию из модуля statistics.

import statistics

num_array = [1, 2, 4, 5]

print(statistics.geometric_mean(num_array))
